src/digitalmodel/solvers/openfoam/templates/hull_resistance/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2312                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale   1;

vertices
(
    (@X0@ @Y0@ @Z0@)
    (@X1@ @Y0@ @Z0@)
    (@X1@ 0 @Z0@)
    (@X0@ 0 @Z0@)

    (@X0@ @Y0@ @Z1@)
    (@X1@ @Y0@ @Z1@)
    (@X1@ 0 @Z1@)
    (@X0@ 0 @Z1@)

    (@X0@ @Y0@ @Z2@)
    (@X1@ @Y0@ @Z2@)
    (@X1@ 0 @Z2@)
    (@X0@ 0 @Z2@)

    (@X0@ @Y0@ @Z3@)
    (@X1@ @Y0@ @Z3@)
    (@X1@ 0 @Z3@)
    (@X0@ 0 @Z3@)

    (@X0@ @Y0@ @Z4@)
    (@X1@ @Y0@ @Z4@)
    (@X1@ 0 @Z4@)
    (@X0@ 0 @Z4@)

    (@X0@ @Y0@ @Z5@)
    (@X1@ @Y0@ @Z5@)
    (@X1@ 0 @Z5@)
    (@X0@ 0 @Z5@)

    (@X0@ @Y0@ @Z6@)
    (@X1@ @Y0@ @Z6@)
    (@X1@ 0 @Z6@)
    (@X0@ 0 @Z6@)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (@NX@ @NY@ @NZA@) simpleGrading (1 1 0.05)
    hex (4 5 6 7 8 9 10 11) (@NX@ @NY@ @NZA@) simpleGrading (1 1 1)
    hex (8 9 10 11 12 13 14 15) (@NX@ @NY@ @NZB@) simpleGrading (1 1 1)
    hex (12 13 14 15 16 17 18 19) (@NX@ @NY@ @NZB@) simpleGrading (1 1 1)
    hex (16 17 18 19 20 21 22 23) (@NX@ @NY@ @NZC@) simpleGrading (1 1 1)
    hex (20 21 22 23 24 25 26 27) (@NX@ @NY@ @NZD@) simpleGrading (1 1 5)
);

edges
(
);

boundary
(
    atmosphere
    {
        type patch;
        faces
        (
            (24 25 26 27)
        );
    }
    inlet
    {
        type patch;
        faces
        (
            (1 2 6 5)
            (5 6 10 9)
            (9 10 14 13)
            (13 14 18 17)
            (17 18 22 21)
            (21 22 26 25)
        );
    }
    outlet
    {
        type patch;
        faces
        (
            (0 4 7 3)
            (4 8 11 7)
            (8 12 15 11)
            (12 16 19 15)
            (16 20 23 19)
            (20 24 27 23)
        );
    }
    bottom
    {
        type symmetryPlane;
        faces
        (
            (0 3 2 1)
        );
    }
    side
    {
        type symmetryPlane;
        faces
        (
            (0 1 5 4)
            (4 5 9 8)
            (8 9 13 12)
            (12 13 17 16)
            (16 17 21 20)
            (20 21 25 24)
        );
    }
    midPlane
    {
        type symmetryPlane;
        faces
        (
            (3 7 6 2)
            (7 11 10 6)
            (11 15 14 10)
            (15 19 18 14)
            (19 23 22 18)
            (23 27 26 22)
        );
    }
);

mergePatchPairs
(
);


// ************************************************************************* //
